{
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of20.bin",
        "group1-shard2of20.bin",
        "group1-shard3of20.bin",
        "group1-shard4of20.bin",
        "group1-shard5of20.bin",
        "group1-shard6of20.bin",
        "group1-shard7of20.bin",
        "group1-shard8of20.bin",
        "group1-shard9of20.bin",
        "group1-shard10of20.bin",
        "group1-shard11of20.bin",
        "group1-shard12of20.bin",
        "group1-shard13of20.bin",
        "group1-shard14of20.bin",
        "group1-shard15of20.bin",
        "group1-shard16of20.bin",
        "group1-shard17of20.bin",
        "group1-shard18of20.bin",
        "group1-shard19of20.bin",
        "group1-shard20of20.bin"
      ],
      "weights": [
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "batch_normalization_1/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "batch_normalization_1/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "batch_normalization_1/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "batch_normalization_1/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "batch_normalization_2/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "batch_normalization_2/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "batch_normalization_2/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "batch_normalization_2/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "batch_normalization_3/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "batch_normalization_3/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "batch_normalization_3/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "batch_normalization_3/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            1024
          ],
          "name": "batch_normalization_4/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            1024
          ],
          "name": "batch_normalization_4/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            1024
          ],
          "name": "batch_normalization_4/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            1024
          ],
          "name": "batch_normalization_4/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block10_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block10_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block10_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block10_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block10_sepconv3/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block10_sepconv3/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv3_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv3_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv3_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block10_sepconv3_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block11_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block11_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block11_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block11_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block11_sepconv3/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block11_sepconv3/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv3_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv3_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv3_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block11_sepconv3_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block12_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block12_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block12_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block12_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block12_sepconv3/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block12_sepconv3/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv3_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv3_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv3_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block12_sepconv3_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block13_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block13_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block13_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block13_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block13_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block13_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block13_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            1024
          ],
          "name": "block13_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1024
          ],
          "name": "block13_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            1024
          ],
          "name": "block13_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            1024
          ],
          "name": "block13_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            1024
          ],
          "name": "block13_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            1024,
            1
          ],
          "name": "block14_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            1024,
            1536
          ],
          "name": "block14_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1536
          ],
          "name": "block14_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            1536
          ],
          "name": "block14_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            1536
          ],
          "name": "block14_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            1536
          ],
          "name": "block14_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            1536,
            1
          ],
          "name": "block14_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            1536,
            2048
          ],
          "name": "block14_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            2048
          ],
          "name": "block14_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            2048
          ],
          "name": "block14_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            2048
          ],
          "name": "block14_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            2048
          ],
          "name": "block14_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            3,
            32
          ],
          "name": "block1_conv1/kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            32
          ],
          "name": "block1_conv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            32
          ],
          "name": "block1_conv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            32
          ],
          "name": "block1_conv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            32
          ],
          "name": "block1_conv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "name": "block1_conv2/kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            64
          ],
          "name": "block1_conv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            64
          ],
          "name": "block1_conv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            64
          ],
          "name": "block1_conv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            64
          ],
          "name": "block1_conv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            64,
            1
          ],
          "name": "block2_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            64,
            128
          ],
          "name": "block2_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "block2_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "block2_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "block2_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "block2_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            128,
            1
          ],
          "name": "block2_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            128,
            128
          ],
          "name": "block2_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "block2_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "block2_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "block2_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            128
          ],
          "name": "block2_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            128,
            1
          ],
          "name": "block3_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            128,
            256
          ],
          "name": "block3_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "block3_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "block3_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "block3_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "block3_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            256,
            1
          ],
          "name": "block3_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            256,
            256
          ],
          "name": "block3_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "block3_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "block3_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "block3_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            256
          ],
          "name": "block3_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            256,
            1
          ],
          "name": "block4_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            256,
            728
          ],
          "name": "block4_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block4_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block4_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block4_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block4_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block4_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block4_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block4_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block4_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block4_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block4_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block5_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block5_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block5_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block5_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block5_sepconv3/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block5_sepconv3/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv3_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv3_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv3_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block5_sepconv3_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block6_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block6_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block6_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block6_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block6_sepconv3/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block6_sepconv3/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv3_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv3_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv3_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block6_sepconv3_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block7_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block7_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block7_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block7_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block7_sepconv3/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block7_sepconv3/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv3_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv3_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv3_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block7_sepconv3_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block8_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block8_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block8_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block8_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block8_sepconv3/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block8_sepconv3/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv3_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv3_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv3_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block8_sepconv3_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block9_sepconv1/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block9_sepconv1/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv1_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv1_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv1_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv1_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block9_sepconv2/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block9_sepconv2/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv2_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv2_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv2_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv2_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            3,
            3,
            728,
            1
          ],
          "name": "block9_sepconv3/depthwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            728
          ],
          "name": "block9_sepconv3/pointwise_kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv3_bn/gamma"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv3_bn/beta"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv3_bn/moving_mean"
        },
        {
          "dtype": "float32",
          "shape": [
            728
          ],
          "name": "block9_sepconv3_bn/moving_variance"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            64,
            128
          ],
          "name": "conv2d_1/kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            128,
            256
          ],
          "name": "conv2d_2/kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            256,
            728
          ],
          "name": "conv2d_3/kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1,
            1,
            728,
            1024
          ],
          "name": "conv2d_4/kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            2048,
            1
          ],
          "name": "dense_1/kernel"
        },
        {
          "dtype": "float32",
          "shape": [
            1
          ],
          "name": "dense_1/bias"
        }
      ]
    }
  ],
  "modelTopology": {
    "training_config": {
      "metrics": [
        "mae"
      ],
      "loss": "mean_squared_error",
      "optimizer_config": {
        "class_name": "RMSprop",
        "config": {
          "epsilon": 1e-07,
          "lr": 9.999999747378752e-05,
          "rho": 0.8999999761581421,
          "decay": 0.0
        }
      },
      "sample_weight_mode": null,
      "loss_weights": null
    },
    "keras_version": "2.2.4",
    "model_config": {
      "class_name": "Model",
      "config": {
        "layers": [
          {
            "class_name": "InputLayer",
            "inbound_nodes": [],
            "config": {
              "dtype": "float32",
              "batch_input_shape": [
                null,
                299,
                299,
                3
              ],
              "name": "input_1",
              "sparse": false
            },
            "name": "input_1"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "block1_conv1",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "dilation_rate": [
                1,
                1
              ],
              "kernel_regularizer": null,
              "filters": 32,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [
                3,
                3
              ]
            },
            "name": "block1_conv1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "block1_conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "block1_conv1_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "block1_conv1_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "block1_conv1_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu",
              "trainable": true,
              "name": "block1_conv1_act"
            },
            "name": "block1_conv1_act"
          },
          {
            "class_name": "Conv2D",
            "inbound_nodes": [
              [
                [
                  "block1_conv1_act",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "block1_conv2",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "linear",
              "trainable": true,
              "data_format": "channels_last",
              "padding": "valid",
              "strides": [
                1,
                1
              ],
              "dilation_rate": [
                1,
                1
              ],
              "kernel_regularizer": null,
              "filters": 64,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "use_bias": false,
              "activity_regularizer": null,
              "kernel_size": [
                3,
                3
              ]
            },
            "name": "block1_conv2"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "block1_conv2",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "block1_conv2_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "scale": true,
              "gamma_regularizer": null,
              "gamma_constraint": null,
              "beta_constraint": null,
              "beta_regularizer": null,
              "momentum": 0.99,
              "axis": -1
            },
            "name": "block1_conv2_bn"
          },
          {
            "class_name": "Activation",
            "inbound_nodes": [
              [
                [
                  "block1_conv2_bn",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "activation": "relu",
              "trainable": true,
              "name": "block1_conv2_act"
            },
            "name": "block1_conv2_act"
          },
          {
            "class_name": "SeparableConv2D",
            "inbound_nodes": [
              [
                [
                  "block1_conv2_act",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "depthwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "bias_regularizer": null,
              "pointwise_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "bias_constraint": null,
              "activity_regularizer": null,
              "trainable": true,
              "pointwise_constraint": null,
              "data_format": "channels_last",
              "depthwise_constraint": null,
              "name": "block2_sepconv1",
              "padding": "same",
              "strides": [
                1,
                1
              ],
              "pointwise_regularizer": null,
              "filters": 128,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "depthwise_regularizer": null,
              "dilation_rate": [
                1,
                1
              ],
              "use_bias": false,
              "activation": "linear",
              "kernel_size": [
                3,
                3
              ],
              "depth_multiplier": 1
            },
            "name": "block2_sepconv1"
          },
          {
            "class_name": "BatchNormalization",
            "inbound_nodes": [
              [
                [
                  "block2_sepconv1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "config": {
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "name": "block2_sepconv1_bn",
              "epsilon": 0.001,
              "trainable": true,
              "center": true,
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
